<a href="https://colab.research.google.com/github/avinashjairam/avinashjairam.github.io/blob/master/Basic_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [45]:
import pandas as pd

#Creating a dataframe from series
#Note a series is a dictionary of dictionaries where the values are lists
roster = {"Name" : ["Bob", "Alice", "Joe", "Mike", "Lisa", "Alan", "Eli", "Mark", "Liz", "Jane"],
          "Major": ["Accounting", "Finance", "Chemistry", "Art", "Engineering", "Biology", "Physics", "History", "Art", "Engineering"],
          "GPA": [3.5, 3.8, 3.2, 3.7, 4.0, 3.5, 3.8, 3.2, 3.1, 3.0],
          "Age": [22, 23, 31, 40, 25, 22, 33, 31, 27, 55]          
          }

roster_df = pd.DataFrame(roster)

roster_df

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5   Alan      Biology  3.5   22
6    Eli      Physics  3.8   33
7   Mark      History  3.2   31
8    Liz          Art  3.1   27
9   Jane  Engineering  3.0   55

In [46]:
#How to rename a column?
#name_of_dataframe.rename(columns = {"Old_Name":New_Name}, inplace=True)
roster_df.rename(columns = {"Name": "First_Name"}, inplace=True)

roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe    Chemistry  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [47]:
#How to modify an individual cell in a table?
#name_of_dataframe.loc[index, "Name_of_column"] = "New Value"
#Here we are changing Joe's major (from the dataframe above) from chemistry to math
roster_df.loc[2,"Major"] = "Math"

roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [48]:
#Demonstration of the "isin" method

#First create a list of items you wish to include in your search
majors = ['Art', 'Engineering', 'Biology']

#create a filter mask and call the "isin" method on the column you are searching
filter_mask = roster_df['Major'].isin(majors)

#apply the filter to the dataframe using loc
roster_df.loc[filter_mask]

  First_Name        Major  GPA  Age
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [5]:
#Negating a filter mask

#First create a filter mask outlining the conditions of your search
filter_mask = (roster_df['Major'] == 'Art') & (roster_df['Age'] > 30)

#Apply the filter_mask to the dataframe but be sure to add ~
#This will return all of the rows which do not satisfy the condition in the filter mask
roster_df.loc[~filter_mask]

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [6]:
#name_of_dataframe.head() returns by default the first 5 rows from the dataframe 
roster_df.head()

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25

In [7]:
#name_of_dataframe.head(n) - returns the first n rows from the dataframe
roster_df.head(1)

  First_Name       Major  GPA  Age
0        Bob  Accounting  3.5   22

In [8]:
#name_of_dataframe.tail() - returns the last 5 rows from the dataframe
roster_df.tail()

  First_Name        Major  GPA  Age
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [9]:
#name_of_dataframe.tail(n) - returns the last n rows from the dataframe
roster_df.tail(3)

  First_Name        Major  GPA  Age
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [10]:
#name_of_dataframe.shape returns a tuple consisting of the number of rows and columns in the dataframe

roster_df.shape

(10, 4)

In [11]:
#The first value in the tuple is the number of rows and the last value in the number of columns
#Here are finding the number of rows in the dataframe
num_rows = roster_df.shape[0]
print(num_rows)

10

In [12]:
#name_of_dataframe.T returns a transpose of the dataframe. Note: This change is not permanent 
roster_df.T

                     0        1     2     3  ...        6        7    8            9
First_Name         Bob    Alice   Joe  Mike  ...      Eli     Mark  Liz         Jane
Major       Accounting  Finance  Math   Art  ...  Physics  History  Art  Engineering
GPA                3.5      3.8   3.2   3.7  ...      3.8      3.2  3.1            3
Age                 22       23    31    40  ...       33       31   27           55

[4 rows x 10 columns]

In [13]:
#name_of_dataframe.sort_value(by='name_of_column', ascending=False) - allows us to sort a dataframe by a particular column, the ascending parameter 
#indicates whether we are sorting in ascending order or not
roster_df.sort_values(by='GPA', ascending= False)

  First_Name        Major  GPA  Age
4       Lisa  Engineering  4.0   25
1      Alice      Finance  3.8   23
6        Eli      Physics  3.8   33
3       Mike          Art  3.7   40
0        Bob   Accounting  3.5   22
5       Alan      Biology  3.5   22
2        Joe         Math  3.2   31
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [14]:
#Displaying the values in a column
#name_of_dataframe['name_of_column]
roster_df['GPA']

0    3.5
1    3.8
2    3.2
3    3.7
4    4.0
5    3.5
6    3.8
7    3.2
8    3.1
9    3.0
Name: GPA, dtype: float64

In [15]:
#Displaying rows in a dataframe
#name_of_dataframe[start:end]
#NOTE: YOU CAN ALSO USE LOC OR ILOC
roster_df[2:5]

  First_Name        Major  GPA  Age
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25

In [16]:
#Filtering a dataframe - ONE WAY OF DOING THINGS
#You can also use a filter mask
roster_df[roster_df['GPA'] < 3.5]

  First_Name        Major  GPA  Age
2        Joe         Math  3.2   31
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [17]:
#Using integer locate -iloc - to access records from particular rows and columns
#name_of_dataframe.iloc[[list of rows],[list of column indexes]]
roster_df.iloc[[1,2,3],[1,2]]

     Major  GPA
1  Finance  3.8
2     Math  3.2
3      Art  3.7

In [40]:
#Using iloc to display the 2nd through 4th rows in the dataframe
roster_df.iloc[2:5]

   Name        Major  GPA  Age
2   Joe    Chemistry  3.2   31
3  Mike          Art  3.7   40
4  Lisa  Engineering  4.0   25

In [18]:
#Just printing the dataframe to remind ourselves of the contents. No special operation done here.
roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [21]:
#Adding a temporary index to a dataframe
roster_df.set_index("First_Name")

                  Major  GPA  Age
First_Name
Bob          Accounting  3.5   22
Alice           Finance  3.8   23
Joe                Math  3.2   31
Mike                Art  3.7   40
Lisa        Engineering  4.0   25
Alan            Biology  3.5   22
Eli             Physics  3.8   33
Mark            History  3.2   31
Liz                 Art  3.1   27
Jane        Engineering  3.0   55

In [24]:
#Note the dataframe reverts to its original indexes since the change above was temporary
roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [25]:
#Adding a permanent index to a dataframe
#name_of_dataframe.set_index("Name of column you wish to make the index", inplace=True)
roster_df.set_index("First_Name", inplace=True)

In [27]:
#Now the index change is permanent
roster_df

                  Major  GPA  Age
First_Name
Bob          Accounting  3.5   22
Alice           Finance  3.8   23
Joe                Math  3.2   31
Mike                Art  3.7   40
Lisa        Engineering  4.0   25
Alan            Biology  3.5   22
Eli             Physics  3.8   33
Mark            History  3.2   31
Liz                 Art  3.1   27
Jane        Engineering  3.0   55

In [28]:
#Viewing all the indexes in the dataframe
#name_of_dataframe.index
roster_df.index

Index(['Bob', 'Alice', 'Joe', 'Mike', 'Lisa', 'Alan', 'Eli', 'Mark', 'Liz',
       'Jane'],
      dtype='object', name='First_Name')

NOTE THE DIFFERENCE BETWEEN loc and iloc: loc is used to 'locate' rows by indexes. Such indexes can be integers, strings,etc. By default, all rows are given zero based numerical indexes. For example, row 1 has an index of 0, row 2 has an index of 1, etc.

iloc is used to locate rows by their numerical position in a dataframe regardless of what their indexes are.

In [44]:
#Note that iloc returns the 1st, 2nd, 3rd rows even though the index has been changed!
roster_df.iloc[1:4]

    Name      Major  GPA  Age
1  Alice    Finance  3.8   23
2    Joe  Chemistry  3.2   31
3   Mike        Art  3.7   40

In [29]:
#Locating record by a particular index
#name_of_dataframe.loc['Name of Index']
roster_df.loc['Alan']

Major    Biology
GPA          3.5
Age           22
Name: Alan, dtype: object

In [30]:
#Viewing the individual cell associated with a particular index
#name_of_dataframe.loc['name-of-index', 'column_name']

roster_df.loc['Alan', 'GPA']

3.5

In [31]:
#Sorting the indexes in descending order
#name_of_dataframe.sort_index(ascending=False)
roster_df.sort_index(ascending=False)

                  Major  GPA  Age
First_Name
Mike                Art  3.7   40
Mark            History  3.2   31
Liz                 Art  3.1   27
Lisa        Engineering  4.0   25
Joe                Math  3.2   31
Jane        Engineering  3.0   55
Eli             Physics  3.8   33
Bob          Accounting  3.5   22
Alice           Finance  3.8   23
Alan            Biology  3.5   22

In [32]:
#Resetting a dataframe back to the original index
#name_of_dataframe.reset_index(inplace=True)
roster_df.reset_index(inplace=True)
roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [33]:
#Here is what happens when you create a conditional statement
#Below we are trying to find all the records where the major is art
#Conditions like the one below are assigned to a filter mask
roster_df['Major'] == 'Art'

0    False
1    False
2    False
3     True
4    False
5    False
6    False
7    False
8     True
9    False
Name: Major, dtype: bool

In [34]:
#Assigning a condition to a filter mask
filter_mask = roster_df['Major'] == 'Art'

In [35]:
#Applying the filter mask to a dataframe
roster_df[filter_mask]

  First_Name Major  GPA  Age
3       Mike   Art  3.7   40
8        Liz   Art  3.1   27

In [36]:
#Using loc to "Filter within a filter mask"
#Here we are displaying all age records from those which were described in the filter mask
#NOTE: .loc can also be used with a filter mask
roster_df.loc[filter_mask, "Age"]

3    40
8    27
Name: Age, dtype: int64

In [37]:
#A filter mask with a more complex condition
filter_mask = (roster_df['Major'] == 'Art') & (roster_df['Age'] > 30)
#NOTE: .loc can also be used with a filter mask
roster_df.loc[filter_mask]

  First_Name Major  GPA  Age
3       Mike   Art  3.7   40

In [38]:
#Just printing the dataframe to remind ourselves of the contents. No special operation done here.

roster_df

  First_Name        Major  GPA  Age
0        Bob   Accounting  3.5   22
1      Alice      Finance  3.8   23
2        Joe         Math  3.2   31
3       Mike          Art  3.7   40
4       Lisa  Engineering  4.0   25
5       Alan      Biology  3.5   22
6        Eli      Physics  3.8   33
7       Mark      History  3.2   31
8        Liz          Art  3.1   27
9       Jane  Engineering  3.0   55

In [39]:
#Merging two data frames vertically, one on top of the other
roster1 = {"Name" : ["Bob", "Alice", "Joe", "Mike", "Lisa", "Alan", "Eli", "Mark", "Liz", "Jane"],
          "Major": ["Accounting", "Finance", "Chemistry", "Art", "Engineering", "Biology", "Physics", "History", "Art", "Engineering"],
          "GPA": [3.5, 3.8, 3.2, 3.7, 4.0, 3.5, 3.8, 3.2, 3.1, 3.0],
          "Age": [22, 23, 31, 40, 25, 22, 33, 31, 27, 55]          
          }

roster1_df = pd.DataFrame(roster1)

roster2 = {"Name" : ["Bob", "Alice", "Joe", "Mike", "Lisa", "Alan", "Eli", "Mark", "Liz", "Jane"],
          "Major": ["Accounting", "Finance", "Chemistry", "Art", "Engineering", "Biology", "Physics", "History", "Art", "Engineering"],
          "GPA": [3.5, 3.8, 3.2, 3.7, 4.0, 3.5, 3.8, 3.2, 3.1, 3.0],
          "Age": [22, 23, 31, 40, 25, 22, 33, 31, 27, 55]          
          }

roster2_df = pd.DataFrame(roster2)

#Note to use of pd.concat and the list of dataframes to be merged

roster_df = pd.concat([roster1_df,roster2_df] )

roster_df

    Name        Major  GPA  Age
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5   Alan      Biology  3.5   22
6    Eli      Physics  3.8   33
7   Mark      History  3.2   31
8    Liz          Art  3.1   27
9   Jane  Engineering  3.0   55
0    Bob   Accounting  3.5   22
1  Alice      Finance  3.8   23
2    Joe    Chemistry  3.2   31
3   Mike          Art  3.7   40
4   Lisa  Engineering  4.0   25
5   Alan      Biology  3.5   22
6    Eli      Physics  3.8   33
7   Mark      History  3.2   31
8    Liz          Art  3.1   27
9   Jane  Engineering  3.0   55